package JavaPRO;

public class Les35_Maven_Part_1 {
    public static void main(String[] args) {
        // Приложения в IntelliJ IDEA создаются в двух форматах .jar для обычных приложений и
        // .war для веб приложений

        //Терминология
        //Artifact - библиотека, готовый проект. Можно подключить к своему проекту
        //Зависимость - сторонняя библиотека
        //Apache Maven - (идиш Собиратель Знаний) - инструмент для сборки проекта и управления
        // зависимостями

        //Для работы с Maven нужно создать новый проект Maven Archetype, для создания обычного
        // проекта выбирается  maven-archetype-quickstart, для создания веб-проекта выбирается
        // maven-archetype-webapp. Все зависимости прописываются в файле pom.xml. В пакете test будут
        // находиться тестовые файлы, а в пакете main основные
    }
}
