package Classes;

public class String {
    public static void main(String[] args) {
        //String

        //Метод isEmpty класса String возвращает true, если строка пустая, если строка
        //заполнена возвращает false
        //Метод valueof() преобразует строку в тот тип данных, который указан в аргументе
        //Метод toUpperCase() чтобы сделать все буквы в переменной String ЗАГЛАВНЫМИ
        //Метод .substring() позволяет отсечь несколько элементов (числа в аргументе метода
        //0 - начало, 5 конец, то есть hello123 будет отображаться с начала и по 5 символ
    }
}
