package Marathon.Day12.Task4;

/**
 * 4. *Выполнятьвподпапке task4 вd ay12*
 * Скопировать MusicBand из прошлого задания и доработать таким образом, чтобы в группу можно было
 * добавлять и удалять участников. Под участником понимается строка (String)с именем и фамилией.
 * Реализовать статический метод слияния групп (в классе MusicBand), т.е. все участники группы А
 * переходят в группу B. Название метода: transferMembers. Этот метод принимает в качестве аргументов
 * два экземпляра класса MusicBand. Реализовать метод printMembers (в классе MusicBand), выводящий
 * список участников в консоль. Проверить состав групп после слияния.
 */
public class Task4 {
    public static void main(String[] args) {

    }
}
