package Marathon.Day2;
/**
 * 2. Есть два числа, которые задаются пользователем через консоль (назовем эти два числа a и b).
 * Используя цикл for, вывести все числа из диапазона между a и b, которые делятся на 5 без остатка,
 * но при этом не делятся на 10 без остатка.
 * Например, число 15 подходит под наше условие (делится на 5 без остатка и не делится
 * на 10 без остатка), но число 20 не подходит под наше условие (делится на 5 без остатка
 *  и делится на 10 без остатка). Сами числа a и b в диапазоне не учитывать. Если a >= b
 * вывести сообщение "Некорректный ввод".
 */

import java.util.Scanner;

public class Task2 {
    public static void main(String[] args) {
        Scanner scanner2 = new Scanner(System.in);
        int a = scanner2.nextInt();
        int b = scanner2.nextInt();
        for ( a = 0; a < b;a++) {
            if (a %5 ==0 && a%10 !=0){
                System.out.println(a);
            }else if (a >= b) {
                System.out.println("Некорректный ввод");
            }
        }
    }
}
